fredcooke/FreeScale-s12x-binutils/binutils-2.20/opcodes/mc9s12x-opc.c
/* m68hc11-opc.c -- Motorola 68HC11 & 68HC12 opcode list
   Copyright 1999, 2000, 2002, 2005, 2007 Free Software Foundation, Inc.
   Written by Stephane Carrez (stcarrez@nerim.fr)

   This file is part of the GNU opcodes library.

   This library is free software; you can redistribute it and/or modify
   it under the terms of the GNU General Public License as published by
   the Free Software Foundation; either version 3, or (at your option)
   any later version.

   It is distributed in the hope that it will be useful, but WITHOUT
   ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
   or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public
   License for more details.

   You should have received a copy of the GNU General Public License
   along with this file; see the file COPYING.  If not, write to the
   Free Software Foundation, 51 Franklin Street - Fifth Floor, Boston,
   MA 02110-1301, USA.  */

#include <stdio.h>
#include "ansidecl.h"
#include "opcode/mc9s12x.h"

#define TABLE_SIZE(X)       (sizeof(X) / sizeof(X[0]))
/*
 * M6812_OP_SEX_MARKER
 * Post-increment mode is not valid for
 * _bfd_merge_private_bfd_data
 */
/* Combination of CCR flags.  */
#define MC9S12X_ZC_BIT    MC9S12X_Z_BIT|MC9S12X_C_BIT
#define MC9S12X_NZ_BIT    MC9S12X_N_BIT|MC9S12X_Z_BIT
#define MC9S12X_NZV_BIT   MC9S12X_N_BIT|MC9S12X_Z_BIT|MC9S12X_V_BIT
#define MC9S12X_NZC_BIT   MC9S12X_N_BIT|MC9S12X_Z_BIT|MC9S12X_C_BIT
#define MC9S12X_NVC_BIT   MC9S12X_N_BIT|MC9S12X_V_BIT|MC9S12X_C_BIT
#define MC9S12X_ZVC_BIT   MC9S12X_Z_BIT|MC9S12X_V_BIT|MC9S12X_C_BIT
#define MC9S12X_NZVC_BIT  MC9S12X_ZVC_BIT|MC9S12X_N_BIT
#define MC9S12X_HNZVC_BIT MC9S12X_NZVC_BIT|MC9S12X_H_BIT
#define MC9S12X_HNVC_BIT  MC9S12X_NVC_BIT|MC9S12X_H_BIT
#define MC9S12X_VC_BIT    MC9S12X_V_BIT|MC9S12X_C_BIT

/* Flags when the insn only changes some CCR flags.  */
#define CHG_NONE        0,0,0
#define CHG_Z           0,0,MC9S12X_Z_BIT
#define CHG_C           0,0,MC9S12X_C_BIT
#define CHG_ZVC         0,0,MC9S12X_ZVC_BIT
#define CHG_NZC         0,0,MC9S12X_NZC_BIT
#define CHG_NZV         0,0,MC9S12X_NZV_BIT
#define CHG_NZVC        0,0,MC9S12X_NZVC_BIT
#define CHG_HNZVC       0,0,MC9S12X_HNZVC_BIT
#define CHG_ALL         0,0,0xff

/* The insn clears and changes some flags.  */
#define CLR_I           0,MC9S12X_I_BIT,0
#define CLR_C           0,MC9S12X_C_BIT,0
#define CLR_V           0,MC9S12X_V_BIT,0
#define CLR_V_CHG_ZC    0,MC9S12X_V_BIT,MC9S12X_ZC_BIT
#define CLR_V_CHG_NZ    0,MC9S12X_V_BIT,MC9S12X_NZ_BIT
#define CLR_V_CHG_ZVC   0,MC9S12X_V_BIT,MC9S12X_ZVC_BIT
#define CLR_N_CHG_ZVC   0,MC9S12X_N_BIT,MC9S12X_ZVC_BIT /* Used by lsr */
#define CLR_VC_CHG_NZ   0,MC9S12X_VC_BIT,MC9S12X_NZ_BIT

/* The insn sets some flags.  */
#define SET_I           MC9S12X_I_BIT,0,0
#define SET_C           MC9S12X_C_BIT,0,0
#define SET_V           MC9S12X_V_BIT,0,0
#define SET_Z_CLR_NVC   MC9S12X_Z_BIT,MC9S12X_NVC_BIT,0
#define SET_C_CLR_V_CHG_NZ MC9S12X_C_BIT,MC9S12X_V_BIT,MC9S12X_NZ_BIT
#define SET_Z_CHG_HNVC  MC9S12X_Z_BIT,0,MC9S12X_HNVC_BIT

#define _M 0xff
#define OP_NONE         MC9S12X_OP_NONE
#define OP_PAGE2        MC9S12X_OP_PAGE2
#define OP_PAGE3        MC9S12X_OP_PAGE3
#define OP_PAGE4        MC9S12X_OP_PAGE4
#define OP_IMM8         MC9S12X_OP_IMM8
#define OP_IMM16        MC9S12X_OP_IMM16
#define OP_IX           MC9S12X_OP_IX
#define OP_IY           MC9S12X_OP_IY
#define OP_IND16        MC9S12X_OP_IND16
#define OP_PAGE         MC9S12X_OP_PAGE  //
#define OP_IDX          MC9S12X_OP_IDX  //was saved
#define OP_IDX_1        MC9S12X_OP_IDX_1//
#define OP_IDX_2        MC9S12X_OP_IDX_2//
#define OP_D_IDX        MC9S12X_OP_D_IDX//
#define OP_D_IDX_2      MC9S12X_OP_D_IDX_2//
#define OP_DIRECT       MC9S12X_OP_DIRECT
#define OP_BITMASK      MC9S12X_OP_BITMASK
#define OP_BRANCH       MC9S12X_OP_BRANCH
#define OP_JUMP_REL     (MC9S12X_OP_JUMP_REL|OP_BRANCH)
#define OP_JUMP_REL16   (MC9S12X_OP_JUMP_REL16|OP_BRANCH)//
#define OP_REG          MC9S12X_OP_REG//
#define OP_REG_1        MC9S12X_OP_REG//
#define OP_REG_2        MC9S12X_OP_REG_2//
#define OP_IDX_p2       MC9S12X_OP_IDX_P2//
#define OP_IND16_p2     MC9S12X_OP_IND16_P2//
#define OP_TRAP_ID      MC9S12X_OP_TRAP_ID//
#define OP_EXG_MARKER   MC9S12X_OP_EXG_MARKER
#define OP_TFR_MARKER   MC9S12X_OP_TFR_MARKER//
#define OP_DBEQ_MARKER  (MC9S12X_OP_DBCC_MARKER|MC9S12X_OP_EQ_MARKER)//
#define OP_DBNE_MARKER  (MC9S12X_OP_DBCC_MARKER)//
#define OP_TBEQ_MARKER  (MC9S12X_OP_TBCC_MARKER|MC9S12X_OP_EQ_MARKER)//
#define OP_TBNE_MARKER  (MC9S12X_OP_TBCC_MARKER)//
#define OP_IBEQ_MARKER  (MC9S12X_OP_IBCC_MARKER|MC9S12X_OP_EQ_MARKER)//
#define OP_IBNE_MARKER  (MC9S12X_OP_IBCC_MARKER)//

/*
   { "test", OP_NONE,          1, 0x00,  5, _M,  CHG_NONE,  cpu6811 },
                                                            +-- cpu
  Name -+                                        +------- Insn CCR changes
  Format  ------+                            +----------- Max # cycles
  Size     --------------------+         +--------------- Min # cycles
                                   +--------------------- Opcode
*/
const struct mc9s12x_opcode mc9s12x_opcodes[] = {
//  { "aba",  OP_NONE,           1, 0x1b,  2,  2,  CHG_HNZVC, cpu6811 },
  { "aba",  OP_NONE | OP_PAGE2,2, 0x06,  2,  2,  CHG_HNZVC, cpumc9s12x },
//  { "abx",  OP_NONE,           1, 0x3a,  3,  3,  CHG_NONE,  cpu6811 },
//  { "aby",  OP_NONE | OP_PAGE2,2, 0x3a,  4,  4,  CHG_NONE,  cpu6811 },

  { "adca", OP_IMM8,           2, 0x89,  1,  1,  CHG_HNZVC, cpu6811|cpumc9s12x },
  { "adca", OP_DIRECT,         2, 0x99,  3,  3,  CHG_HNZVC, cpu6811|cpumc9s12x },
  { "adca", OP_IND16,          3, 0xb9,  3,  3,  CHG_HNZVC, cpu6811|cpumc9s12x },
//  { "adca", OP_IX,             2, 0xa9,  4,  4,  CHG_HNZVC, cpu6811 },
//  { "adca", OP_IY | OP_PAGE2,  3, 0xa9,  5,  5,  CHG_HNZVC, cpu6811 },
  { "adca", OP_IDX,            2, 0xa9,  3,  3,  CHG_HNZVC, cpumc9s12x },
  { "adca", OP_IDX_1,          3, 0xa9,  3,  3,  CHG_HNZVC, cpumc9s12x },
  { "adca", OP_IDX_2,          4, 0xa9,  4,  4,  CHG_HNZVC, cpumc9s12x },
  { "adca", OP_D_IDX,          2, 0xa9,  6,  6,  CHG_HNZVC, cpumc9s12x },
  { "adca", OP_D_IDX_2,        4, 0xa9,  6,  6,  CHG_HNZVC, cpumc9s12x },

  { "adcb", OP_IMM8,           2, 0xc9,  1,  1,  CHG_HNZVC, cpu6811|cpumc9s12x },
  { "adcb", OP_DIRECT,         2, 0xd9,  3,  3,  CHG_HNZVC, cpu6811|cpumc9s12x },
  { "adcb", OP_IND16,          3, 0xf9,  3,  3,  CHG_HNZVC, cpu6811|cpumc9s12x },
//  { "adcb", OP_IX,             2, 0xe9,  4,  4,  CHG_HNZVC, cpu6811 },
//  { "adcb", OP_IY | OP_PAGE2,  3, 0xe9,  5,  5,  CHG_HNZVC, cpu6811 },
  { "adcb", OP_IDX,            2, 0xe9,  3,  3,  CHG_HNZVC, cpumc9s12x },
  { "adcb", OP_IDX_1,          3, 0xe9,  3,  3,  CHG_HNZVC, cpumc9s12x },
  { "adcb", OP_IDX_2,          4, 0xe9,  4,  4,  CHG_HNZVC, cpumc9s12x },
  { "adcb", OP_D_IDX,          2, 0xe9,  6,  6,  CHG_HNZVC, cpumc9s12x },
  { "adcb", OP_D_IDX_2,        4, 0xe9,  6,  6,  CHG_HNZVC, cpumc9s12x },

