fredcooke/FreeScale-s12x-binutils/binutils-2.20/opcodes/mc9s12x-opc.c
//  { "clra", OP_NONE,           1, 0x4f,  2,  2,  SET_Z_CLR_NVC, cpu6811 },
//  { "clrb", OP_NONE,           1, 0x5f,  2,  2,  SET_Z_CLR_NVC, cpu6811 },
  { "clra", OP_NONE,           1, 0x87,  1,  1,  SET_Z_CLR_NVC, cpumc9s12x },
  { "clrb", OP_NONE,           1, 0xc7,  1,  1,  SET_Z_CLR_NVC, cpumc9s12x },

//  { "clv",  OP_NONE,           1, 0x0a,  2,  2,  CLR_V, cpu6811 },

  { "cmpa", OP_IMM8,           2, 0x81,  1,  1,  CHG_NZVC, cpu6811|cpumc9s12x },
  { "cmpa", OP_DIRECT,         2, 0x91,  3,  3,  CHG_NZVC, cpu6811|cpumc9s12x },
  { "cmpa", OP_IND16,          3, 0xb1,  3,  3,  CHG_NZVC, cpu6811|cpumc9s12x },
//  { "cmpa", OP_IX,             2, 0xa1,  4,  4,  CHG_NZVC, cpu6811 },
//  { "cmpa", OP_IY | OP_PAGE2,  3, 0xa1,  5,  5,  CHG_NZVC, cpu6811 },
  { "cmpa", OP_IDX,            2, 0xa1,  3,  3,  CHG_NZVC, cpumc9s12x },
  { "cmpa", OP_IDX_1,          3, 0xa1,  3,  3,  CHG_NZVC, cpumc9s12x },
  { "cmpa", OP_IDX_2,          4, 0xa1,  4,  4,  CHG_NZVC, cpumc9s12x },
  { "cmpa", OP_D_IDX,          2, 0xa1,  6,  6,  CHG_NZVC, cpumc9s12x },
  { "cmpa", OP_D_IDX_2,        4, 0xa1,  6,  6,  CHG_NZVC, cpumc9s12x },

  { "cmpb", OP_IMM8,           2, 0xc1,  1,  1,  CHG_NZVC, cpu6811|cpumc9s12x },
  { "cmpb", OP_DIRECT,         2, 0xd1,  3,  3,  CHG_NZVC, cpu6811|cpumc9s12x },
  { "cmpb", OP_IND16,          3, 0xf1,  3,  3,  CHG_NZVC, cpu6811|cpumc9s12x },
//  { "cmpb", OP_IX,             2, 0xe1,  4,  4,  CHG_NZVC, cpu6811 },
//  { "cmpb", OP_IY | OP_PAGE2,  3, 0xe1,  5,  5,  CHG_NZVC, cpu6811 },
  { "cmpb", OP_IDX,            2, 0xe1,  3,  3,  CHG_NZVC, cpumc9s12x },
  { "cmpb", OP_IDX_1,          3, 0xe1,  3,  3,  CHG_NZVC, cpumc9s12x },
  { "cmpb", OP_IDX_2,          4, 0xe1,  4,  4,  CHG_NZVC, cpumc9s12x },
  { "cmpb", OP_D_IDX,          2, 0xe1,  6,  6,  CHG_NZVC, cpumc9s12x },
  { "cmpb", OP_D_IDX_2,        4, 0xe1,  6,  6,  CHG_NZVC, cpumc9s12x },

//  { "com", OP_IND16,           3, 0x73,  6,  6,  SET_C_CLR_V_CHG_NZ, cpu6811 },
//  { "com", OP_IX,              2, 0x63,  6,  6,  SET_C_CLR_V_CHG_NZ, cpu6811 },
//  { "com", OP_IY | OP_PAGE2,   3, 0x63,  7,  7,  SET_C_CLR_V_CHG_NZ, cpu6811 },
  { "com", OP_IND16,           3, 0x71,  4,  4,  SET_C_CLR_V_CHG_NZ, cpumc9s12x },
  { "com", OP_IDX,             2, 0x61,  3,  3,  SET_C_CLR_V_CHG_NZ, cpumc9s12x },
  { "com", OP_IDX_1,           3, 0x61,  4,  4,  SET_C_CLR_V_CHG_NZ, cpumc9s12x },
  { "com", OP_IDX_2,           4, 0x61,  5,  5,  SET_C_CLR_V_CHG_NZ, cpumc9s12x },
  { "com", OP_D_IDX,           2, 0x61,  6,  6,  SET_C_CLR_V_CHG_NZ, cpumc9s12x },
  { "com", OP_D_IDX_2,         4, 0x61,  6,  6,  SET_C_CLR_V_CHG_NZ, cpumc9s12x },

//  { "coma", OP_NONE,           1, 0x43,  2,  2,  SET_C_CLR_V_CHG_NZ, cpu6811 },
  { "coma", OP_NONE,           1, 0x41,  1,  1,  SET_C_CLR_V_CHG_NZ, cpumc9s12x },
//  { "comb", OP_NONE,           1, 0x53,  2,  2,  SET_C_CLR_V_CHG_NZ, cpu6811 },
  { "comb", OP_NONE,           1, 0x51,  1,  1,  SET_C_CLR_V_CHG_NZ, cpumc9s12x },

//  { "cpd", OP_IMM16 | OP_PAGE3,  4, 0x83,  5,  5,  CHG_NZVC, cpu6811 },
//  { "cpd", OP_DIRECT | OP_PAGE3, 3, 0x93,  6,  6,  CHG_NZVC, cpu6811 },
//  { "cpd", OP_IND16 | OP_PAGE3,  4, 0xb3,  7,  7,  CHG_NZVC, cpu6811 },
//  { "cpd", OP_IX | OP_PAGE3,     3, 0xa3,  7,  7,  CHG_NZVC, cpu6811 },
//  { "cpd", OP_IY | OP_PAGE4,     3, 0xa3,  7,  7,  CHG_NZVC, cpu6811 },
  { "cpd", OP_IMM16,             3, 0x8c,  2,  2,  CHG_NZVC, cpumc9s12x },
  { "cpd", OP_DIRECT,            2, 0x9c,  3,  3,  CHG_NZVC, cpumc9s12x },
  { "cpd", OP_IND16,             3, 0xbc,  3,  3,  CHG_NZVC, cpumc9s12x },
  { "cpd", OP_IDX,               2, 0xac,  3,  3,  CHG_NZVC, cpumc9s12x },
  { "cpd", OP_IDX_1,             3, 0xac,  3,  3,  CHG_NZVC, cpumc9s12x },
  { "cpd", OP_IDX_2,             4, 0xac,  4,  4,  CHG_NZVC, cpumc9s12x },
  { "cpd", OP_D_IDX,             2, 0xac,  6,  6,  CHG_NZVC, cpumc9s12x },
  { "cpd", OP_D_IDX_2,           4, 0xac,  6,  6,  CHG_NZVC, cpumc9s12x },

  { "cps", OP_IMM16,             3, 0x8f,  2,  2,  CHG_NZVC, cpumc9s12x },
  { "cps", OP_DIRECT,            2, 0x9f,  3,  3,  CHG_NZVC, cpumc9s12x },
  { "cps", OP_IND16,             3, 0xbf,  3,  3,  CHG_NZVC, cpumc9s12x },
  { "cps", OP_IDX,               2, 0xaf,  3,  3,  CHG_NZVC, cpumc9s12x },
  { "cps", OP_IDX_1,             3, 0xaf,  3,  3,  CHG_NZVC, cpumc9s12x },
  { "cps", OP_IDX_2,             4, 0xaf,  4,  4,  CHG_NZVC, cpumc9s12x },
  { "cps", OP_D_IDX,             2, 0xaf,  6,  6,  CHG_NZVC, cpumc9s12x },
  { "cps", OP_D_IDX_2,           4, 0xaf,  6,  6,  CHG_NZVC, cpumc9s12x },

//  { "cpx", OP_IMM16,             3, 0x8c,  4,  4,  CHG_NZVC, cpu6811 },
//  { "cpx", OP_DIRECT,            2, 0x9c,  5,  5,  CHG_NZVC, cpu6811 },
//  { "cpx", OP_IND16,             3, 0xbc,  5,  5,  CHG_NZVC, cpu6811 },
//  { "cpx", OP_IX,                2, 0xac,  6,  6,  CHG_NZVC, cpu6811 },
//  { "cpx", OP_IY | OP_PAGE4,     3, 0xac,  7,  7,  CHG_NZVC, cpu6811 },
  { "cpx", OP_IMM16,             3, 0x8e,  2,  2,  CHG_NZVC, cpumc9s12x },
  { "cpx", OP_DIRECT,            2, 0x9e,  3,  3,  CHG_NZVC, cpumc9s12x },
  { "cpx", OP_IND16,             3, 0xbe,  3,  3,  CHG_NZVC, cpumc9s12x },
  { "cpx", OP_IDX,               2, 0xae,  3,  3,  CHG_NZVC, cpumc9s12x },
  { "cpx", OP_IDX_1,             3, 0xae,  3,  3,  CHG_NZVC, cpumc9s12x },
  { "cpx", OP_IDX_2,             4, 0xae,  4,  4,  CHG_NZVC, cpumc9s12x },
  { "cpx", OP_D_IDX,             2, 0xae,  6,  6,  CHG_NZVC, cpumc9s12x },
  { "cpx", OP_D_IDX_2,           4, 0xae,  6,  6,  CHG_NZVC, cpumc9s12x },

//  { "cpy", OP_PAGE2 | OP_IMM16,  4, 0x8c,  5,  5,  CHG_NZVC, cpu6811 },
//  { "cpy", OP_PAGE2 | OP_DIRECT, 3, 0x9c,  6,  6,  CHG_NZVC, cpu6811 },
//  { "cpy", OP_PAGE2 | OP_IY,     3, 0xac,  7,  7,  CHG_NZVC, cpu6811 },
//  { "cpy", OP_PAGE2 | OP_IND16,  4, 0xbc,  7,  7,  CHG_NZVC, cpu6811 },
//  { "cpy", OP_PAGE3 | OP_IX,     3, 0xac,  7,  7,  CHG_NZVC, cpu6811 },
  { "cpy", OP_IMM16,             3, 0x8d,  2,  2,  CHG_NZVC, cpumc9s12x },
  { "cpy", OP_DIRECT,            2, 0x9d,  3,  3,  CHG_NZVC, cpumc9s12x },
  { "cpy", OP_IND16,             3, 0xbd,  3,  3,  CHG_NZVC, cpumc9s12x },
  { "cpy", OP_IDX,               2, 0xad,  3,  3,  CHG_NZVC, cpumc9s12x },
  { "cpy", OP_IDX_1,             3, 0xad,  3,  3,  CHG_NZVC, cpumc9s12x },
  { "cpy", OP_IDX_2,             4, 0xad,  4,  4,  CHG_NZVC, cpumc9s12x },
  { "cpy", OP_D_IDX,             2, 0xad,  6,  6,  CHG_NZVC, cpumc9s12x },
  { "cpy", OP_D_IDX_2,           4, 0xad,  6,  6,  CHG_NZVC, cpumc9s12x },

